Sure thing, I'll try to explain myself better.

This would be the complete configuration and should be enough to reproduce the issue:

```
resource "google_eventarc_trigger" "trigger_name" {
  name     = "trigger_name"
  location = "eu"
  project  = var.project_id
  provider = google
  matching_criteria {
    attribute = "type"
    value     = "google.cloud.storage.object.v1.finalized"
  }

  matching_criteria {
    attribute = "bucket"
    value     = var.bucket_name
  }

  destination {
    cloud_run_service {
      service = "cloud-run-to-be-triggered"
      region  = var.region
      path    = "/v1/ingest"
    }
  }
  service_account = var.service_account_email
  labels          = local.labels
}

resource "google_pubsub_subscription" "eventarc-sub" {
  project = var.project_id
  provider = google
  name    = element(split("/", google_eventarc_trigger.trigger_name.transport[0].pubsub[0].subscription), length(split("/", google_eventarc_trigger.trigger_name.transport[0].pubsub[0].subscription)) - 1)
  topic   = element(split("/", google_eventarc_trigger.trigger_name.transport[0].pubsub[0].topic), length(split("/", google_eventarc_trigger.trigger_name.transport[0].pubsub[0].topic)) - 1)

  ack_deadline_seconds = 600

  depends_on = [
    google_eventarc_trigger.trigger_name
  ]
}
```

What I think is happening is this:

1. The Eventarc trigger gets created by Terraform -> this creates a PubSub topic and a subscription, resources "managed" by the Eventarc trigger
2. I retrieve the created subscription from the resource outputs
3. I use that value in the google_pubsub_subscription resource to update the `ack_deadline_seconds` attribute to 600
4. It fails with 409 Error because terraform is trying to create a new subscription with the same name, and not updating the existing one

```
Terraform will perform the following actions:

  # google_eventarc_trigger.ania_ingestion_trigger will be created
  + resource "google_eventarc_trigger" "trigger_name" {
      + create_time     = (known after apply)
      + etag            = (known after apply)
      + id              = (known after apply)

      + location        = "eu"
      + name            = "trigger_name"
      + project         = "it-nonprod-gen-advana-000031"
      + service_account = "sa-ania-ibd-processor@it-nonprod-gen-advana-000031.iam.gserviceaccount.com"
      + uid             = (known after apply)
      + update_time     = (known after apply)

      + destination {
          + cloud_run_service {
              + path    = "gimo/v1/ingest"
              + region  = "europe-west3"
              + service = "cloud-run-to-be-triggered"
            }
        }

      + matching_criteria {
          + attribute = "bucket"
          + value     = "bucket-name"
        }
      + matching_criteria {
          + attribute = "type"
          + value     = "google.cloud.storage.object.v1.finalized"
        }

      + transport {
          + pubsub {
              + subscription = (known after apply)
              + topic        = (known after apply)
            }
        }
    }

  # google_pubsub_subscription.eventarc-ingestion-sub will be created
  + resource "google_pubsub_subscription" "eventarc-sub" {
      + ack_deadline_seconds       = 600
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = (known after apply)
      + project                    = "it-nonprod-gen-advana-000031"
      + topic                      = (known after apply)

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"

+ pwd
+ terraform '-chdir=/var/lib/jenkins/workspace/sw00250-aa-sources-gi/ania-ibd-processor/terraform-ania-ibd-processor-dev/tf' apply -no-color -compact-warnings terraform.plan
google_eventarc_trigger.ania_ingestion_trigger: Creating...
google_eventarc_trigger.ania_ingestion_trigger: Still creating... [10s elapsed]
google_eventarc_trigger.ania_ingestion_trigger: Creation complete after 16s [id=projects/it-nonprod-gen-advana-000031/locations/eu/triggers/ania-ingestion-trigger]
google_pubsub_subscription.eventarc-ingestion-sub: Creating...

Error: Error creating Subscription: googleapi: Error 409: Resource already exists in the project (resource=eventarc-eu-trigger-name-sub-624).

  with google_pubsub_subscription.eventarc-ingestion-sub,
  on gen_data_red.tf line 126, in resource "google_pubsub_subscription" "eventarc-ingestion-sub":
 126: resource "google_pubsub_subscription" "eventarc-ingestion-sub" {

Finished: FAILURE
```




